app/views/artists/index.html.erb

<table class="table">
<% @artists = Artist.all %>
---
SELECT "artists".* FROM "artists"