app/views/songs/index.html.erb

<table class="table">
<% @songs = Song.all %>
---
SELECT "songs".* FROM "songs"