app/views/songs/show.html.erb

    <%= form.label :Question_1 %>
    <%= form.collection_select :answer, Question.order(:text), :id, :text, { include_blank: false }, { class: "form-control" } %>
---
SELECT "questions".* FROM "questions"  ORDER BY "questions"."text" ASC