app/views/surveys/show.html.erb

SELECT "answers".* FROM "answers"  ORDER BY "answers"."text" ASC
---
    <%= form.label :Question_1 %>
    <%= form.collection_select :survey, Answer.order(:text), :id, :text, { include_blank: false }, { class: "form-control" } %>