app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @song = Song.find_by(id: params["id"])

INSERT INTO "songs" ("name", "year_released", "artist_id") VALUES (?, ?, ?)  [["name", "khorshids test"], ["year_released", "2008"], ["artist_id", 3]]
---
  def create
    song_params = params.require(:song).permit!
      @song = Song.create(song_params)