app/controllers/surveys_controller.rb

  def find_song
    @song = Song.find_by(id: params["song_id"])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 17]]